faisyl/espmic/client/sdkconfig.defaults
# ESP32-S3 Network Audio Device — Default SDK Configuration
# Target: ESP32-S3 with PSRAM

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash size (partition table needs >2 MB; use 8 MB, a common ESP32-S3
# --- DevKitC default) ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# --- PSRAM ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# --- Wi-Fi ---
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# --- TLS (mbedtls) ---
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# --- Networking ---
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_RCVBUF=y

# --- NVS ---
CONFIG_NVS_ENCRYPTION=n

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# --- Partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Stack sizes for audio tasks ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
